__Importing the necessary library__

In [2]:
import pandas as pd 
import numpy as np

#2. Create 3 differents Series, each of length 100, as follows:

1. The first a random number from 1 to 4
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [3]:
s1 = pd.Series(np.random.randint(1, high=5, size=100, dtype='l'))
s2 = pd.Series(np.random.randint(1, high=4, size=100, dtype='l'))
s3 = pd.Series(np.random.randint(10000, high=30001, size=100, dtype='l'))

In [7]:
#3. Let's create a DataFrame by joinning the Series by column
housemkt=  pd.concat([s1, s2, s3], axis=1)
housemkt.head()

   0  1      2
0  3  1  14366
1  4  1  27794
2  1  2  14590
3  4  3  27846
4  4  3  13787

In [8]:
#4. Change the name of the columns to bedrs, bathrs, price_sqr_meter
housemkt.rename(columns={0: 'bedrs', 1: 'bathrs', 2: 'price_sqr_meter'}, inplace=True)
housemkt.head()

   bedrs  bathrs  price_sqr_meter
0      3       1            14366
1      4       1            27794
2      1       2            14590
3      4       3            27846
4      4       3            13787

In [11]:
#5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'
bigcolumn = pd.concat([s1, s2, s3], axis=0)
#converting it to DataFrame
bigcolumn = bigcolumn.to_frame()
print(bigcolumn.head())
bigcolumn

   0
0  3
1  4
2  1
3  4
4  4

        0
0       3
1       4
2       1
3       4
4       4
..    ...
95  29614
96  17287
97  14473
98  26573
99  27443

[300 rows x 1 columns]

In [12]:
#6. Oops, it seems it is going only until index 99. Is it true?
len(bigcolumn)

300

In [15]:
#7. Reindex the DataFrame so it goes from 0 to 299
bigcolumn.reset_index(drop=True, inplace=True)
bigcolumn

         0
0        3
1        4
2        1
3        4
4        4
..     ...
295  29614
296  17287
297  14473
298  26573
299  27443

[300 rows x 1 columns]